espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EZR32HG/Include/ezr32hg_usartrf.h
/* Bit fields for USARTRF RXDOUBLEXP */
#define _USARTRF_RXDOUBLEXP_RESETVALUE          0x00000000UL                                 /**< Default value for USARTRF_RXDOUBLEXP */
#define _USARTRF_RXDOUBLEXP_MASK                0xC1FFC1FFUL                                 /**< Mask for USARTRF_RXDOUBLEXP */
#define _USARTRF_RXDOUBLEXP_RXDATAP0_SHIFT      0                                            /**< Shift value for USART_RXDATAP0 */
#define _USARTRF_RXDOUBLEXP_RXDATAP0_MASK       0x1FFUL                                      /**< Bit mask for USART_RXDATAP0 */
#define _USARTRF_RXDOUBLEXP_RXDATAP0_DEFAULT    0x00000000UL                                 /**< Mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_RXDATAP0_DEFAULT     (_USARTRF_RXDOUBLEXP_RXDATAP0_DEFAULT << 0)  /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_PERRP0               (0x1UL << 14)                                /**< Data Parity Error 0 Peek */
#define _USARTRF_RXDOUBLEXP_PERRP0_SHIFT        14                                           /**< Shift value for USART_PERRP0 */
#define _USARTRF_RXDOUBLEXP_PERRP0_MASK         0x4000UL                                     /**< Bit mask for USART_PERRP0 */
#define _USARTRF_RXDOUBLEXP_PERRP0_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_PERRP0_DEFAULT       (_USARTRF_RXDOUBLEXP_PERRP0_DEFAULT << 14)   /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_FERRP0               (0x1UL << 15)                                /**< Data Framing Error 0 Peek */
#define _USARTRF_RXDOUBLEXP_FERRP0_SHIFT        15                                           /**< Shift value for USART_FERRP0 */
#define _USARTRF_RXDOUBLEXP_FERRP0_MASK         0x8000UL                                     /**< Bit mask for USART_FERRP0 */
#define _USARTRF_RXDOUBLEXP_FERRP0_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_FERRP0_DEFAULT       (_USARTRF_RXDOUBLEXP_FERRP0_DEFAULT << 15)   /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEXP */
#define _USARTRF_RXDOUBLEXP_RXDATAP1_SHIFT      16                                           /**< Shift value for USART_RXDATAP1 */
#define _USARTRF_RXDOUBLEXP_RXDATAP1_MASK       0x1FF0000UL                                  /**< Bit mask for USART_RXDATAP1 */
#define _USARTRF_RXDOUBLEXP_RXDATAP1_DEFAULT    0x00000000UL                                 /**< Mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_RXDATAP1_DEFAULT     (_USARTRF_RXDOUBLEXP_RXDATAP1_DEFAULT << 16) /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_PERRP1               (0x1UL << 30)                                /**< Data Parity Error 1 Peek */
#define _USARTRF_RXDOUBLEXP_PERRP1_SHIFT        30                                           /**< Shift value for USART_PERRP1 */
#define _USARTRF_RXDOUBLEXP_PERRP1_MASK         0x40000000UL                                 /**< Bit mask for USART_PERRP1 */
#define _USARTRF_RXDOUBLEXP_PERRP1_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_PERRP1_DEFAULT       (_USARTRF_RXDOUBLEXP_PERRP1_DEFAULT << 30)   /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_FERRP1               (0x1UL << 31)                                /**< Data Framing Error 1 Peek */
#define _USARTRF_RXDOUBLEXP_FERRP1_SHIFT        31                                           /**< Shift value for USART_FERRP1 */
#define _USARTRF_RXDOUBLEXP_FERRP1_MASK         0x80000000UL                                 /**< Bit mask for USART_FERRP1 */
#define _USARTRF_RXDOUBLEXP_FERRP1_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for USARTRF_RXDOUBLEXP */
#define USARTRF_RXDOUBLEXP_FERRP1_DEFAULT       (_USARTRF_RXDOUBLEXP_FERRP1_DEFAULT << 31)   /**< Shifted mode DEFAULT for USARTRF_RXDOUBLEXP */

/* Bit fields for USARTRF TXDATAX */
#define _USARTRF_TXDATAX_RESETVALUE             0x00000000UL                             /**< Default value for USARTRF_TXDATAX */
#define _USARTRF_TXDATAX_MASK                   0x0000F9FFUL                             /**< Mask for USARTRF_TXDATAX */
#define _USARTRF_TXDATAX_TXDATAX_SHIFT          0                                        /**< Shift value for USART_TXDATAX */
#define _USARTRF_TXDATAX_TXDATAX_MASK           0x1FFUL                                  /**< Bit mask for USART_TXDATAX */
#define _USARTRF_TXDATAX_TXDATAX_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_TXDATAX_DEFAULT         (_USARTRF_TXDATAX_TXDATAX_DEFAULT << 0)  /**< Shifted mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_UBRXAT                  (0x1UL << 11)                            /**< Unblock RX After Transmission */
#define _USARTRF_TXDATAX_UBRXAT_SHIFT           11                                       /**< Shift value for USART_UBRXAT */
#define _USARTRF_TXDATAX_UBRXAT_MASK            0x800UL                                  /**< Bit mask for USART_UBRXAT */
#define _USARTRF_TXDATAX_UBRXAT_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_UBRXAT_DEFAULT          (_USARTRF_TXDATAX_UBRXAT_DEFAULT << 11)  /**< Shifted mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_TXTRIAT                 (0x1UL << 12)                            /**< Set TXTRI After Transmission */
#define _USARTRF_TXDATAX_TXTRIAT_SHIFT          12                                       /**< Shift value for USART_TXTRIAT */
#define _USARTRF_TXDATAX_TXTRIAT_MASK           0x1000UL                                 /**< Bit mask for USART_TXTRIAT */
#define _USARTRF_TXDATAX_TXTRIAT_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_TXTRIAT_DEFAULT         (_USARTRF_TXDATAX_TXTRIAT_DEFAULT << 12) /**< Shifted mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_TXBREAK                 (0x1UL << 13)                            /**< Transmit Data As Break */
#define _USARTRF_TXDATAX_TXBREAK_SHIFT          13                                       /**< Shift value for USART_TXBREAK */
#define _USARTRF_TXDATAX_TXBREAK_MASK           0x2000UL                                 /**< Bit mask for USART_TXBREAK */
#define _USARTRF_TXDATAX_TXBREAK_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_TXBREAK_DEFAULT         (_USARTRF_TXDATAX_TXBREAK_DEFAULT << 13) /**< Shifted mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_TXDISAT                 (0x1UL << 14)                            /**< Clear TXEN After Transmission */
#define _USARTRF_TXDATAX_TXDISAT_SHIFT          14                                       /**< Shift value for USART_TXDISAT */
#define _USARTRF_TXDATAX_TXDISAT_MASK           0x4000UL                                 /**< Bit mask for USART_TXDISAT */
#define _USARTRF_TXDATAX_TXDISAT_DEFAULT        0x00000000UL                             /**< Mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_TXDISAT_DEFAULT         (_USARTRF_TXDATAX_TXDISAT_DEFAULT << 14) /**< Shifted mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_RXENAT                  (0x1UL << 15)                            /**< Enable RX After Transmission */
#define _USARTRF_TXDATAX_RXENAT_SHIFT           15                                       /**< Shift value for USART_RXENAT */
#define _USARTRF_TXDATAX_RXENAT_MASK            0x8000UL                                 /**< Bit mask for USART_RXENAT */
#define _USARTRF_TXDATAX_RXENAT_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for USARTRF_TXDATAX */
#define USARTRF_TXDATAX_RXENAT_DEFAULT          (_USARTRF_TXDATAX_RXENAT_DEFAULT << 15)  /**< Shifted mode DEFAULT for USARTRF_TXDATAX */

/* Bit fields for USARTRF TXDATA */
#define _USARTRF_TXDATA_RESETVALUE              0x00000000UL                          /**< Default value for USARTRF_TXDATA */
#define _USARTRF_TXDATA_MASK                    0x000000FFUL                          /**< Mask for USARTRF_TXDATA */
#define _USARTRF_TXDATA_TXDATA_SHIFT            0                                     /**< Shift value for USART_TXDATA */
#define _USARTRF_TXDATA_TXDATA_MASK             0xFFUL                                /**< Bit mask for USART_TXDATA */
#define _USARTRF_TXDATA_TXDATA_DEFAULT          0x00000000UL                          /**< Mode DEFAULT for USARTRF_TXDATA */
#define USARTRF_TXDATA_TXDATA_DEFAULT           (_USARTRF_TXDATA_TXDATA_DEFAULT << 0) /**< Shifted mode DEFAULT for USARTRF_TXDATA */

