espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EZR32HG/Include/ezr32hg_usartrf.h
/* Bit fields for USARTRF IFS */
#define _USARTRF_IFS_RESETVALUE                 0x00000000UL                       /**< Default value for USARTRF_IFS */
#define _USARTRF_IFS_MASK                       0x00001FF9UL                       /**< Mask for USARTRF_IFS */
#define USARTRF_IFS_TXC                         (0x1UL << 0)                       /**< Set TX Complete Interrupt Flag */
#define _USARTRF_IFS_TXC_SHIFT                  0                                  /**< Shift value for USART_TXC */
#define _USARTRF_IFS_TXC_MASK                   0x1UL                              /**< Bit mask for USART_TXC */
#define _USARTRF_IFS_TXC_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_TXC_DEFAULT                 (_USARTRF_IFS_TXC_DEFAULT << 0)    /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_RXFULL                      (0x1UL << 3)                       /**< Set RX Buffer Full Interrupt Flag */
#define _USARTRF_IFS_RXFULL_SHIFT               3                                  /**< Shift value for USART_RXFULL */
#define _USARTRF_IFS_RXFULL_MASK                0x8UL                              /**< Bit mask for USART_RXFULL */
#define _USARTRF_IFS_RXFULL_DEFAULT             0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_RXFULL_DEFAULT              (_USARTRF_IFS_RXFULL_DEFAULT << 3) /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_RXOF                        (0x1UL << 4)                       /**< Set RX Overflow Interrupt Flag */
#define _USARTRF_IFS_RXOF_SHIFT                 4                                  /**< Shift value for USART_RXOF */
#define _USARTRF_IFS_RXOF_MASK                  0x10UL                             /**< Bit mask for USART_RXOF */
#define _USARTRF_IFS_RXOF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_RXOF_DEFAULT                (_USARTRF_IFS_RXOF_DEFAULT << 4)   /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_RXUF                        (0x1UL << 5)                       /**< Set RX Underflow Interrupt Flag */
#define _USARTRF_IFS_RXUF_SHIFT                 5                                  /**< Shift value for USART_RXUF */
#define _USARTRF_IFS_RXUF_MASK                  0x20UL                             /**< Bit mask for USART_RXUF */
#define _USARTRF_IFS_RXUF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_RXUF_DEFAULT                (_USARTRF_IFS_RXUF_DEFAULT << 5)   /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_TXOF                        (0x1UL << 6)                       /**< Set TX Overflow Interrupt Flag */
#define _USARTRF_IFS_TXOF_SHIFT                 6                                  /**< Shift value for USART_TXOF */
#define _USARTRF_IFS_TXOF_MASK                  0x40UL                             /**< Bit mask for USART_TXOF */
#define _USARTRF_IFS_TXOF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_TXOF_DEFAULT                (_USARTRF_IFS_TXOF_DEFAULT << 6)   /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_TXUF                        (0x1UL << 7)                       /**< Set TX Underflow Interrupt Flag */
#define _USARTRF_IFS_TXUF_SHIFT                 7                                  /**< Shift value for USART_TXUF */
#define _USARTRF_IFS_TXUF_MASK                  0x80UL                             /**< Bit mask for USART_TXUF */
#define _USARTRF_IFS_TXUF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_TXUF_DEFAULT                (_USARTRF_IFS_TXUF_DEFAULT << 7)   /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_PERR                        (0x1UL << 8)                       /**< Set Parity Error Interrupt Flag */
#define _USARTRF_IFS_PERR_SHIFT                 8                                  /**< Shift value for USART_PERR */
#define _USARTRF_IFS_PERR_MASK                  0x100UL                            /**< Bit mask for USART_PERR */
#define _USARTRF_IFS_PERR_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_PERR_DEFAULT                (_USARTRF_IFS_PERR_DEFAULT << 8)   /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_FERR                        (0x1UL << 9)                       /**< Set Framing Error Interrupt Flag */
#define _USARTRF_IFS_FERR_SHIFT                 9                                  /**< Shift value for USART_FERR */
#define _USARTRF_IFS_FERR_MASK                  0x200UL                            /**< Bit mask for USART_FERR */
#define _USARTRF_IFS_FERR_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_FERR_DEFAULT                (_USARTRF_IFS_FERR_DEFAULT << 9)   /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_MPAF                        (0x1UL << 10)                      /**< Set Multi-Processor Address Frame Interrupt Flag */
#define _USARTRF_IFS_MPAF_SHIFT                 10                                 /**< Shift value for USART_MPAF */
#define _USARTRF_IFS_MPAF_MASK                  0x400UL                            /**< Bit mask for USART_MPAF */
#define _USARTRF_IFS_MPAF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_MPAF_DEFAULT                (_USARTRF_IFS_MPAF_DEFAULT << 10)  /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_SSM                         (0x1UL << 11)                      /**< Set Slave-Select in Master mode Interrupt Flag */
#define _USARTRF_IFS_SSM_SHIFT                  11                                 /**< Shift value for USART_SSM */
#define _USARTRF_IFS_SSM_MASK                   0x800UL                            /**< Bit mask for USART_SSM */
#define _USARTRF_IFS_SSM_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_SSM_DEFAULT                 (_USARTRF_IFS_SSM_DEFAULT << 11)   /**< Shifted mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_CCF                         (0x1UL << 12)                      /**< Set Collision Check Fail Interrupt Flag */
#define _USARTRF_IFS_CCF_SHIFT                  12                                 /**< Shift value for USART_CCF */
#define _USARTRF_IFS_CCF_MASK                   0x1000UL                           /**< Bit mask for USART_CCF */
#define _USARTRF_IFS_CCF_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFS */
#define USARTRF_IFS_CCF_DEFAULT                 (_USARTRF_IFS_CCF_DEFAULT << 12)   /**< Shifted mode DEFAULT for USARTRF_IFS */

/* Bit fields for USARTRF IFC */
#define _USARTRF_IFC_RESETVALUE                 0x00000000UL                       /**< Default value for USARTRF_IFC */
#define _USARTRF_IFC_MASK                       0x00001FF9UL                       /**< Mask for USARTRF_IFC */
#define USARTRF_IFC_TXC                         (0x1UL << 0)                       /**< Clear TX Complete Interrupt Flag */
#define _USARTRF_IFC_TXC_SHIFT                  0                                  /**< Shift value for USART_TXC */
#define _USARTRF_IFC_TXC_MASK                   0x1UL                              /**< Bit mask for USART_TXC */
#define _USARTRF_IFC_TXC_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_TXC_DEFAULT                 (_USARTRF_IFC_TXC_DEFAULT << 0)    /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_RXFULL                      (0x1UL << 3)                       /**< Clear RX Buffer Full Interrupt Flag */
#define _USARTRF_IFC_RXFULL_SHIFT               3                                  /**< Shift value for USART_RXFULL */
#define _USARTRF_IFC_RXFULL_MASK                0x8UL                              /**< Bit mask for USART_RXFULL */
#define _USARTRF_IFC_RXFULL_DEFAULT             0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_RXFULL_DEFAULT              (_USARTRF_IFC_RXFULL_DEFAULT << 3) /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_RXOF                        (0x1UL << 4)                       /**< Clear RX Overflow Interrupt Flag */
#define _USARTRF_IFC_RXOF_SHIFT                 4                                  /**< Shift value for USART_RXOF */
#define _USARTRF_IFC_RXOF_MASK                  0x10UL                             /**< Bit mask for USART_RXOF */
#define _USARTRF_IFC_RXOF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_RXOF_DEFAULT                (_USARTRF_IFC_RXOF_DEFAULT << 4)   /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_RXUF                        (0x1UL << 5)                       /**< Clear RX Underflow Interrupt Flag */
#define _USARTRF_IFC_RXUF_SHIFT                 5                                  /**< Shift value for USART_RXUF */
#define _USARTRF_IFC_RXUF_MASK                  0x20UL                             /**< Bit mask for USART_RXUF */
#define _USARTRF_IFC_RXUF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_RXUF_DEFAULT                (_USARTRF_IFC_RXUF_DEFAULT << 5)   /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_TXOF                        (0x1UL << 6)                       /**< Clear TX Overflow Interrupt Flag */
#define _USARTRF_IFC_TXOF_SHIFT                 6                                  /**< Shift value for USART_TXOF */
#define _USARTRF_IFC_TXOF_MASK                  0x40UL                             /**< Bit mask for USART_TXOF */
#define _USARTRF_IFC_TXOF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_TXOF_DEFAULT                (_USARTRF_IFC_TXOF_DEFAULT << 6)   /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_TXUF                        (0x1UL << 7)                       /**< Clear TX Underflow Interrupt Flag */
#define _USARTRF_IFC_TXUF_SHIFT                 7                                  /**< Shift value for USART_TXUF */
#define _USARTRF_IFC_TXUF_MASK                  0x80UL                             /**< Bit mask for USART_TXUF */
#define _USARTRF_IFC_TXUF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_TXUF_DEFAULT                (_USARTRF_IFC_TXUF_DEFAULT << 7)   /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_PERR                        (0x1UL << 8)                       /**< Clear Parity Error Interrupt Flag */
#define _USARTRF_IFC_PERR_SHIFT                 8                                  /**< Shift value for USART_PERR */
#define _USARTRF_IFC_PERR_MASK                  0x100UL                            /**< Bit mask for USART_PERR */
#define _USARTRF_IFC_PERR_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_PERR_DEFAULT                (_USARTRF_IFC_PERR_DEFAULT << 8)   /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_FERR                        (0x1UL << 9)                       /**< Clear Framing Error Interrupt Flag */
#define _USARTRF_IFC_FERR_SHIFT                 9                                  /**< Shift value for USART_FERR */
#define _USARTRF_IFC_FERR_MASK                  0x200UL                            /**< Bit mask for USART_FERR */
#define _USARTRF_IFC_FERR_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_FERR_DEFAULT                (_USARTRF_IFC_FERR_DEFAULT << 9)   /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_MPAF                        (0x1UL << 10)                      /**< Clear Multi-Processor Address Frame Interrupt Flag */
#define _USARTRF_IFC_MPAF_SHIFT                 10                                 /**< Shift value for USART_MPAF */
#define _USARTRF_IFC_MPAF_MASK                  0x400UL                            /**< Bit mask for USART_MPAF */
#define _USARTRF_IFC_MPAF_DEFAULT               0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_MPAF_DEFAULT                (_USARTRF_IFC_MPAF_DEFAULT << 10)  /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_SSM                         (0x1UL << 11)                      /**< Clear Slave-Select In Master Mode Interrupt Flag */
#define _USARTRF_IFC_SSM_SHIFT                  11                                 /**< Shift value for USART_SSM */
#define _USARTRF_IFC_SSM_MASK                   0x800UL                            /**< Bit mask for USART_SSM */
#define _USARTRF_IFC_SSM_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_SSM_DEFAULT                 (_USARTRF_IFC_SSM_DEFAULT << 11)   /**< Shifted mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_CCF                         (0x1UL << 12)                      /**< Clear Collision Check Fail Interrupt Flag */
#define _USARTRF_IFC_CCF_SHIFT                  12                                 /**< Shift value for USART_CCF */
#define _USARTRF_IFC_CCF_MASK                   0x1000UL                           /**< Bit mask for USART_CCF */
#define _USARTRF_IFC_CCF_DEFAULT                0x00000000UL                       /**< Mode DEFAULT for USARTRF_IFC */
#define USARTRF_IFC_CCF_DEFAULT                 (_USARTRF_IFC_CCF_DEFAULT << 12)   /**< Shifted mode DEFAULT for USARTRF_IFC */

/* Bit fields for USARTRF IEN */
#define _USARTRF_IEN_RESETVALUE                 0x00000000UL                        /**< Default value for USARTRF_IEN */
#define _USARTRF_IEN_MASK                       0x00001FFFUL                        /**< Mask for USARTRF_IEN */
#define USARTRF_IEN_TXC                         (0x1UL << 0)                        /**< TX Complete Interrupt Enable */
#define _USARTRF_IEN_TXC_SHIFT                  0                                   /**< Shift value for USART_TXC */
#define _USARTRF_IEN_TXC_MASK                   0x1UL                               /**< Bit mask for USART_TXC */
#define _USARTRF_IEN_TXC_DEFAULT                0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_TXC_DEFAULT                 (_USARTRF_IEN_TXC_DEFAULT << 0)     /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_TXBL                        (0x1UL << 1)                        /**< TX Buffer Level Interrupt Enable */
#define _USARTRF_IEN_TXBL_SHIFT                 1                                   /**< Shift value for USART_TXBL */
#define _USARTRF_IEN_TXBL_MASK                  0x2UL                               /**< Bit mask for USART_TXBL */
#define _USARTRF_IEN_TXBL_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_TXBL_DEFAULT                (_USARTRF_IEN_TXBL_DEFAULT << 1)    /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_RXDATAV                     (0x1UL << 2)                        /**< RX Data Valid Interrupt Enable */
#define _USARTRF_IEN_RXDATAV_SHIFT              2                                   /**< Shift value for USART_RXDATAV */
#define _USARTRF_IEN_RXDATAV_MASK               0x4UL                               /**< Bit mask for USART_RXDATAV */
#define _USARTRF_IEN_RXDATAV_DEFAULT            0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_RXDATAV_DEFAULT             (_USARTRF_IEN_RXDATAV_DEFAULT << 2) /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_RXFULL                      (0x1UL << 3)                        /**< RX Buffer Full Interrupt Enable */
#define _USARTRF_IEN_RXFULL_SHIFT               3                                   /**< Shift value for USART_RXFULL */
#define _USARTRF_IEN_RXFULL_MASK                0x8UL                               /**< Bit mask for USART_RXFULL */
#define _USARTRF_IEN_RXFULL_DEFAULT             0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_RXFULL_DEFAULT              (_USARTRF_IEN_RXFULL_DEFAULT << 3)  /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_RXOF                        (0x1UL << 4)                        /**< RX Overflow Interrupt Enable */
#define _USARTRF_IEN_RXOF_SHIFT                 4                                   /**< Shift value for USART_RXOF */
#define _USARTRF_IEN_RXOF_MASK                  0x10UL                              /**< Bit mask for USART_RXOF */
#define _USARTRF_IEN_RXOF_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_RXOF_DEFAULT                (_USARTRF_IEN_RXOF_DEFAULT << 4)    /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_RXUF                        (0x1UL << 5)                        /**< RX Underflow Interrupt Enable */
#define _USARTRF_IEN_RXUF_SHIFT                 5                                   /**< Shift value for USART_RXUF */
#define _USARTRF_IEN_RXUF_MASK                  0x20UL                              /**< Bit mask for USART_RXUF */
#define _USARTRF_IEN_RXUF_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_RXUF_DEFAULT                (_USARTRF_IEN_RXUF_DEFAULT << 5)    /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_TXOF                        (0x1UL << 6)                        /**< TX Overflow Interrupt Enable */
#define _USARTRF_IEN_TXOF_SHIFT                 6                                   /**< Shift value for USART_TXOF */
#define _USARTRF_IEN_TXOF_MASK                  0x40UL                              /**< Bit mask for USART_TXOF */
#define _USARTRF_IEN_TXOF_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_TXOF_DEFAULT                (_USARTRF_IEN_TXOF_DEFAULT << 6)    /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_TXUF                        (0x1UL << 7)                        /**< TX Underflow Interrupt Enable */
#define _USARTRF_IEN_TXUF_SHIFT                 7                                   /**< Shift value for USART_TXUF */
#define _USARTRF_IEN_TXUF_MASK                  0x80UL                              /**< Bit mask for USART_TXUF */
#define _USARTRF_IEN_TXUF_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_TXUF_DEFAULT                (_USARTRF_IEN_TXUF_DEFAULT << 7)    /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_PERR                        (0x1UL << 8)                        /**< Parity Error Interrupt Enable */
#define _USARTRF_IEN_PERR_SHIFT                 8                                   /**< Shift value for USART_PERR */
#define _USARTRF_IEN_PERR_MASK                  0x100UL                             /**< Bit mask for USART_PERR */
#define _USARTRF_IEN_PERR_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_PERR_DEFAULT                (_USARTRF_IEN_PERR_DEFAULT << 8)    /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_FERR                        (0x1UL << 9)                        /**< Framing Error Interrupt Enable */
#define _USARTRF_IEN_FERR_SHIFT                 9                                   /**< Shift value for USART_FERR */
#define _USARTRF_IEN_FERR_MASK                  0x200UL                             /**< Bit mask for USART_FERR */
#define _USARTRF_IEN_FERR_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_FERR_DEFAULT                (_USARTRF_IEN_FERR_DEFAULT << 9)    /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_MPAF                        (0x1UL << 10)                       /**< Multi-Processor Address Frame Interrupt Enable */
#define _USARTRF_IEN_MPAF_SHIFT                 10                                  /**< Shift value for USART_MPAF */
#define _USARTRF_IEN_MPAF_MASK                  0x400UL                             /**< Bit mask for USART_MPAF */
#define _USARTRF_IEN_MPAF_DEFAULT               0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_MPAF_DEFAULT                (_USARTRF_IEN_MPAF_DEFAULT << 10)   /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_SSM                         (0x1UL << 11)                       /**< Slave-Select In Master Mode Interrupt Enable */
#define _USARTRF_IEN_SSM_SHIFT                  11                                  /**< Shift value for USART_SSM */
#define _USARTRF_IEN_SSM_MASK                   0x800UL                             /**< Bit mask for USART_SSM */
#define _USARTRF_IEN_SSM_DEFAULT                0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_SSM_DEFAULT                 (_USARTRF_IEN_SSM_DEFAULT << 11)    /**< Shifted mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_CCF                         (0x1UL << 12)                       /**< Collision Check Fail Interrupt Enable */
#define _USARTRF_IEN_CCF_SHIFT                  12                                  /**< Shift value for USART_CCF */
#define _USARTRF_IEN_CCF_MASK                   0x1000UL                            /**< Bit mask for USART_CCF */
#define _USARTRF_IEN_CCF_DEFAULT                0x00000000UL                        /**< Mode DEFAULT for USARTRF_IEN */
#define USARTRF_IEN_CCF_DEFAULT                 (_USARTRF_IEN_CCF_DEFAULT << 12)    /**< Shifted mode DEFAULT for USARTRF_IEN */

